app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'some director'
---
  def samedirector
    @movie = Movie.find(params[:id])
    if @movie.director.blank?